BitBoxSwiss/bitbox02-firmware/src/da14531/da14531.c
// SPDX-License-Identifier: Apache-2.0

#include "da14531.h"
#include "da14531_protocol.h"
#include "hardfault.h"
#include "util.h"
#include <rust/rust.h>
#include <utils_assert.h>

enum da14531_connected_state da14531_connected_state = DA14531_CONNECTED_ADVERTISING;

void da14531_reset(struct RustByteQueue* uart_out)
{
    util_log("da14531_reset");
    uint8_t payload = CTRL_CMD_BLE_CHIP_RESET;
    uint8_t buf[12 + sizeof(payload) * 2] = {0};
    uint16_t len = da14531_protocol_format(
        &buf[0], sizeof(buf), DA14531_PROTOCOL_PACKET_TYPE_CTRL_DATA, &payload, 1);
    ASSERT(len <= sizeof(buf));
    for (int i = 0; i < len; i++) {
        rust_bytequeue_put(uart_out, buf[i]);
    }
}

void da14531_power_down(struct RustByteQueue* uart_out)
{
    util_log("da14531_power_down");
    uint8_t payload[2] = {CTRL_CMD_BLE_POWER_DOWN, 0};
    uint8_t buf[12 + sizeof(payload) * 2] = {0};
    uint16_t len = da14531_protocol_format(
        &buf[0], sizeof(buf), DA14531_PROTOCOL_PACKET_TYPE_CTRL_DATA, &payload[0], sizeof(payload));
    ASSERT(len <= sizeof(buf));
    for (int i = 0; i < len; i++) {
        rust_bytequeue_put(uart_out, buf[i]);
    }
}

void da14531_set_product(
    volatile const uint8_t* product,
    volatile uint16_t product_len,
    struct RustByteQueue* uart_out)
{
    uint8_t payload[64] = {0};
    if (product_len > sizeof(payload) - 1) {
        Abort("product string too large");
        return;
    }
    payload[0] = CTRL_CMD_PRODUCT_STRING;
    for (int i = 0; i < product_len; i++) {
        payload[1 + i] = product[i];
    }
    uint8_t tmp[12 + sizeof(payload) * 2];
    uint16_t tmp_len = da14531_protocol_format(
        &tmp[0], sizeof(tmp), DA14531_PROTOCOL_PACKET_TYPE_CTRL_DATA, &payload[0], 1 + product_len);
    ASSERT(tmp_len <= sizeof(tmp));
    for (int i = 0; i < tmp_len; i++) {
        rust_bytequeue_put(uart_out, tmp[i]);
    }
}

void da14531_set_name(const char* name, struct RustByteQueue* uart_out)
{
    size_t name_len = strlen(name);
    uint8_t payload[64] = {0};
    size_t payload_name_len = MIN(name_len, sizeof(payload) - 1);
    payload[0] = CTRL_CMD_DEVICE_NAME;
    memcpy(&payload[1], name, payload_name_len);
    uint8_t tmp[12 + sizeof(payload) * 2];
    uint16_t tmp_len = da14531_protocol_format(
        &tmp[0],
        sizeof(tmp),
        DA14531_PROTOCOL_PACKET_TYPE_CTRL_DATA,
        &payload[0],
        1 + payload_name_len);
    ASSERT(tmp_len <= sizeof(tmp));
    for (int i = 0; i < tmp_len; i++) {
        rust_bytequeue_put(uart_out, tmp[i]);
    }
}

void da14531_get_connection_state(struct RustByteQueue* uart_out)
{
    uint8_t payload = CTRL_CMD_BLE_STATUS;
    uint8_t tmp[12 + sizeof(payload) * 2];
    uint16_t tmp_len = da14531_protocol_format(
        &tmp[0], sizeof(tmp), DA14531_PROTOCOL_PACKET_TYPE_CTRL_DATA, &payload, 1);
    ASSERT(tmp_len <= sizeof(tmp));
    for (int i = 0; i < tmp_len; i++) {
        rust_bytequeue_put(uart_out, tmp[i]);
    }
}
